---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Stairs.DesiredRisersNumber
zh: 楼梯
source: html/a595b61c-47d2-0194-a4c6-5945c6bb591b.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.DesiredRisersNumber Property

**中文**: 楼梯

The number of risers is calculated based on the height between levels.

## Syntax (C#)
```csharp
public int DesiredRisersNumber { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for numberOfRisers is not positive.